{
    "title": "奏者自身による照明操作によって即興演奏を視覚的に強調するシステムの提案",
    "abstract": "照明演出の研究では，音や動きに反応して自動で変化するシステムや事前準備を簡単にする手法が提案されているが, 即興演奏においては，演奏者の意図に沿った“キメ”の演出やその場の変化への柔軟な対応が難しいという課題がある．そこで本研究では即興演奏における照明表現の質を高めることを目的に，演奏者がリアルタイムに操作できる2 種類の照明制御デバイスを試作し実験を行った．演奏中に操作しやすい足元を活用し，フットボタンと感圧センサを用いたシステムを構築した．",
    "keywords": [],
    "segments": [
        {
            "type": "SectionTitle",
            "sign": "1.",
            "title": null,
            "content": "はじめに"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "音楽ライブでは演奏をその場で体感できることにより，録音された音楽を聴く場合と比べて，より強い感動や会場全体の一体感を得ることができる．こうした臨場感をさらに高める要素として，照明演出が重要な役割を果たしている．照明によって音楽の雰囲気や盛り上がりが視覚的に強調され，演奏の魅力がより効果的に伝わる．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "ライブ演出で用いられる照明には，ステージ全体を照らす「パーライト」，動きや色の変化が自在な「ムービングライト」，壁面を染める「バーライト」などがあり，それぞれが音楽の演出に応じて使い分けられている．これらの照明機器は，DMX512 という専用の制御信号で細かく動作が管理されている．この信号によって，色・明るさ・動きなどを一括して制御することが可能となる．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "通常，このような照明演出は「照明制御卓」と呼ばれる機器を用いて操作される．事前に照明の状態をプログラムしておき，ライブ中にオペレーターがタイミングを見て呼び出すことで，音楽と連動した演出が行われる．しかし，ジャズやフュージョンなどの即興性を含む演奏では，進行が演奏者の判断によって変化するため，事前にプログラムされた照明では対応しきれないという課題がある．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "本研究では，演奏者自身がリアルタイムで照明を操作できるシステムを提案する．演奏の流れを最もよく理解している演奏者が，自らのタイミングで照明を操作できれば，即興性の高い演奏にも柔軟に対応した照明演出が可能となる．これにより，演出の幅を広げ，より一体感のあるライ音楽と視覚演出の融合を目的とした研究はこれまでにも数多く行われており，特に照明や映像を用いた表現に関する技術的アプローチが注目されている．"
        },
        {
            "type": "SectionTitle",
            "sign": "",
            "title": null,
            "content": "ブ体験を実現することを目的とする．"
        },
        {
            "type": "SectionTitle",
            "sign": "2.",
            "title": null,
            "content": "関連研究"
        },
        {
            "type": "FootNote",
            "sign": "1",
            "title": null,
            "content": "東京工科大学大学院バイオ情報メディア研究科メディアサイエンス専攻"
        },
        {
            "type": "FootNote",
            "sign": "a)",
            "title": null,
            "content": "g31240235d@edu.teu.ac.jp"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "神野ら[1] は，楽曲の歌詞や曲調の印象に基づき，舞台照明の調光・調色・配置を自動生成するシステムを提案した．このシステムは形態素解析により歌詞を単語レベルで分析し，得られた印象に応じた照明演出を自動的に構築するものである．これにより，個人の感性に依存せず安定した演出が可能となり，観客に対して楽曲のストーリー性や感情をより忠実に伝えることができるとされる．今後は文脈単位での分析やVR 空間への応用も視野に入れて研究が進められている．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "田嶋ら[2] は，電子ピアノの演奏に合わせて映像がリアルタイムに生成されるシステムを開発した．音高やベロシティなどの演奏情報をMIDI インタフェース経由で取得し，TouchDesigner を用いて即時的な映像出力を行うものである．このシステムは演奏者にとって視覚と聴覚を統合した新たな体験を提供し，リアルタイム性とインタラクティブ性を重視した音楽表現の可能性を提示している．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "これらの先行研究に共通する特徴は，照明や映像演出の自動化や可視化によって，演出設計の負担を軽減することに主眼が置かれている点である．多くの場合，演者自身の操作によるリアルタイムの表現ではなく，あらかじめ定義されたアルゴリズムやデータに基づいて演出が行われる．たとえば，ギター演奏におけるストローク動作に連動して照明の色や動作が変化する手法では，演者の身体動作が照明制御と直結しているものの，その動作自体は演奏上必然的に発生するものであるため，演出を“操作している”という感覚は生まれにくく，演出タイミングの意図的な調整（いわゆる“キメ”）が困難であるという課題があった．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "これに対し，本研究では，演奏者自身が意図したタイミングで照明を操作できることに重きを置き，操作性と即興性を両立させた照明操作システムを提案する．特にMIDIフットコントローラーや身体装着型の感圧センサといったデバイスを用いることで，演出と演奏を同時に行う新たなライブ表現のスタイルを可能にし，従来の自動生成的なアプローチとは異なる方向性を提示している．"
        },
        {
            "type": "SectionTitle",
            "sign": "3.",
            "title": null,
            "content": "システム詳細"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "本研究では，即興的な演奏における照明演出の柔軟性を高めることを目的として，演奏者自身が足元の操作によって照明を制御できる2 種類のシステムを開発した．1つ目はMIDI フットコントローラーを用いた方式，2 つ目はM5StickC PLUS2 と感圧センサを組み合わせた体装着型システムである．いずれも，ビジュアルプログラミングツールであるTouchDesigner を用いて実装した．"
        },
        {
            "type": "SectionTitle",
            "sign": "3.1",
            "title": null,
            "content": "MIDI フットコントローラーを用いたシステム"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "1 つ目のシステムでは，演奏者が足元で操作可能なMIDIフットコントローラーとして，Bluetooth 接続に対応し複数のボタンを備えるXSONIC 社製AIRSTEP を採用し，照明の各種演出を操作できる構成とした．各スイッチには，LED の色変更，ストロボ点滅，照明の一括消灯などの機能を割り当てており，演奏中に任意のタイミングで操作することが可能である．照明の色制御に関しては，あらかじめ複数の候補色を設定しておき，スイッチが押されるたびにその中からランダムに1色が選択される仕様とした．すべてのスイッチでこの色変更機能が反応するように設定されている．MIDI信号はTouchDesigner上で受信・解析され，照明機器ごとのアドレス情報をもとにDMX信号として再構成される．出力された信号はDMX変換ケーブルを介して照明機器に送信され，リアルタイムに演出が反映される．実際に使用すると図1のようになる．"
        },
        {
            "type": "SectionTitle",
            "sign": "3.2",
            "title": null,
            "content": "感圧センサとマイコンを用いたシステム"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "2つ目のシステムは，演奏者の身体動作を活用して照明を操作することを目的として，感圧センサと小型マイコンを用いた装着型照明操作システムを開発した．"
        },
        {
            "type": "SectionTitle",
            "sign": "3.2.1",
            "title": null,
            "content": "ハードウェア構成"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "感圧センサは，押される強さに応じて電気抵抗が変化するセンサであり，この抵抗値の変化を読み取ることで「どれくらいの力で踏み込んだか」を数値として取得することができる．M5StickCPLUS2は，無線通信機能を備えた小型のマイコンで，電池が内蔵されているため，パソコンとセンサとの間に有線接続を必要としないという利点がある．本研究ではこの特徴を活かし，足元の自由な動きを妨げずに照明操作が行えるようにする目的で本マイコンを採用した．"
        },
        {
            "type": "Figure",
            "sign": "1",
            "title": "MIDI フットコントローラーを使用している様子",
            "content": "\n"
        },
        {
            "type": "Figure",
            "sign": "2",
            "title": "装着型デバイス全体図",
            "content": "\n"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "図2 に本デバイスの全体構造を示す．センサは，つま先の形状に合わせてレーザーカットした木板に埋め込み，足への固定にはマジックテープバンドを用いた．M5StickC本体は，3D プリンタで作成した専用ホルダーを介して足首部に装着している．さらに，図3 に示すように，感圧センサの上部には薄いスポンジと下敷きを重ねた構造とすることで，ある程度の意識的な踏み込み動作によってのみ反応するように調整した．実際に足へ取り付けると図4 のようになる．これにより，演奏中の無意識な足の動きによる誤作動を防止しつつ，身体の自由度を損なわない安定した操作性を実現している．"
        },
        {
            "type": "SectionTitle",
            "sign": "3.2.2",
            "title": null,
            "content": "TouchDesigner 側の構成"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "M5StickC PLUS2 は感圧センサのアナログ値をリアルタイムに取得し，Bluetooth 経由でPC 上のTouchDesignerにデータを送信する．TouchDesigner 上ではこの入力値に対してしきい値処理を施しており，センサ値があらかじめ設定したしきい値を超えた場合にのみ照明が反応するよう設計している．これにより，微細な足の動きに起因する誤動作を防ぎつつ，意図的な操作による照明の発動が可能となる．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "また，センサ値の大きさに応じて照明の明るさが段階的に変化する設計とすることで，演奏者の踏み込みの強さによって，照明の明暗を滑らかにコントロールすることができる．特にバーライトにおいては，内側から外側に向かって順に光が広がるように，各チャンネルの点灯タイミングにごく短い遅延（ディレイ）を加えた．この演出によって，照明に動きと流れが生まれ，視覚的に印象的な演出効果をもたらすことができる．その後DMX 変換ケーブルを介して照明機器へ出力する点は，前述のMIDI 方式と共通している．"
        },
        {
            "type": "Figure",
            "sign": "3",
            "title": "装着型デバイス詳細図",
            "content": "\n図3装着型デバイス詳細図\n\n図4装着型デバイスを取り付けた様子\n"
        },
        {
            "type": "SectionTitle",
            "sign": "4.",
            "title": null,
            "content": "実験"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "2025 年7 月，開発した2 種類の照明操作システムについて，演奏中の照明制御における有用性を検証するための実験を実施した．被験者には楽器演奏の経験を持つ者を選定し，照明操作を伴う実際の演奏を通してシステムの使用感を評価した．実験はLED パーライト2 台，バーライト2台，ムービングライト2 台を用いて図5 のようにライブ空間を簡易的に再現した環境で行った．参加者には，開始前に約5 分間の操作説明と試用を行ったのち，TouchDesignerによって制御される照明機器の前で自由に選んだ楽曲を演奏しながら照明操作を行ってもらった．参加者はMIDIフットコントローラーを用いた方式で8 人，感圧センサとマイコンを用いた方式で7 人，実験を行った．図6は実験の様子である．MIDIフットコントローラー方式（以下，A方式）においては，5つのスイッチにそれぞれ色変更，ストロボ点滅，ムービングライトの動作，LEDパーライトの全消灯，およびバーライトの点灯といった照明機能を割り当てており，照明の色は事前に設定した候補からランダムに変化するよう設定した．一方，M5StickCPLUS2 と感圧センサによる方式では，足のつま先に取り付けられたセンサを踏み込む動作により，バーライトが滑らかに点灯するように構成されており，連続的かつ直感的な照明表現が可能となっている．演奏終了後には，思い通りに照明を操作できたかどうかという操作感，操作自体の楽しさ，照明操作が演奏に与えた支障の大きさ，および今後このシステムを使用したいかという意欲の4 点について，いずれも7 段階の主観評価（1: 全くそう思わない～7：非常にそう思う）を行った．さらに，自由記述欄を設け，操作時の印象や改善点に関する意見を収集した．"
        },
        {
            "type": "Figure",
            "sign": "6",
            "title": "詳細図",
            "content": "\n図5実験風景\n\n"
        },
        {
            "type": "SectionTitle",
            "sign": "5.",
            "title": null,
            "content": "考察"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "アンケートの結果は図7 のとおりである．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "以下，MIDI フットコントローラーによるシステムをA方式，感圧センサとマイコンによる体装着型システムをB 方式と呼ぶ．この結果から，A 方式は「操作感」（平均5.25）および「楽しさ」（平均6.75）の観点で高い評価を得たことがわかった．スイッチ操作によって多彩な照明効果を演出できることが，使用者にとって“照明を操作している実感”を強く与えたものと考えられる．また，操作結果が即座に照明演出として視覚的に反映される点も，楽しさの要因として機能していたと推察される．一方，「演奏への支障」（平均3.86）の項目においては，B 方式（平均4.57）に比べてやや低い結果を示した．これは足元の複数スイッチ操作が演奏の流れを中断する要因となったためであると考えられる．しかしこの傾向は演奏者の楽器種別によって差が見られ，標準偏差の観点においても比較的ばらつきが多いことがわかる．ギターやベースなど，日常的にエフェクターを用いる奏者においては，足元での操作に対する抵抗が少ないという結果があった一方で，フットコントローラーの使用に不慣れな演奏者は，視線を足元に落とす必要性から，演奏への集中を妨げられたと感じた例も見受けられた．このことから，A 方式の操作性は使用者の経験や演奏スタイルに強く依存することが明らかとなった．また，いくつかの自由記述では「慣れによって操作性が向上する」との言及もあり，初回使用時と継続使用時で評価が変化する可能性がある．"
        },
        {
            "type": "Figure",
            "sign": "7",
            "title": "A 方式とB 方式の比較",
            "content": "\n図7A 方式とB 方式の比較\n"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "一方，B方式は，「演奏への支障の少なさ」（平均4.57）において高い評価を示した．センサを踏み込むだけで照明操作が完了するため，演奏動作を妨げにくく，演奏と操作の同時進行がしやすいことが利点として挙げられる．ただし，操作の実感（平均4.57）という点ではA方式にやや劣る傾向がみられ，特に照明の配置が演者の背後にある場合，自らの操作によって何が起きたのかを即座に視認しづらく，“照明を操作している”という感覚が薄れるという意見があった．また，装着位置についても改良の余地が指摘されており，「かかとにセンサを装着したほうが自然で操作感を得やすい」といった声が複数見られた．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "以上を踏まえると，A方式は多機能で没入感の高い操作体験を提供しつつも，演奏スタイルや操作経験に依存した習熟が必要である．一方B方式は操作の容易さ，演奏への支障の少なさが魅力であるものの，多彩な演出表現にはさらなる改良が求められる．"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "両方式は設置型・装着型というインタフェース設計の根本的な違いによって異なる特性を持ち，使用環境や演奏者の属性に応じた適切な選択が求められるといえる．"
        },
        {
            "type": "SectionTitle",
            "sign": "6.",
            "title": null,
            "content": "まとめと今後の展望"
        },
        {
            "type": "Paragraph",
            "sign": null,
            "title": null,
            "content": "本研究では，演奏者自身が即興的に照明を操作できるシステムとして，MIDIフットコントローラー方式と感圧センサとマイコンを用いた装着型デバイス方式の2 種類を開発し，それぞれの操作性や演奏への影響について比較・評価を行った．実験の結果，MIDI 方式は操作の楽しさや演出の多様性において高い評価を得た一方，操作に慣れていない参加者や，足元操作に集中しづらい演奏スタイルにおいては，支障を感じる場面も見られた．一方，感圧センサ方式は身体動作に自然に組み込まれる点で演奏への支障が少なく，演奏の自由度を損なわない操作が可能であることが示されたが，操作の実感や演出の多様性には課題が残った．今後は，より自然で正確な操作を実現するために，装着型システムの改良が求められる．特にセンサの装着位置や反応の設計を見直すことで，より直感的な操作をできるようにしていきたい．さらに，本研究ではギターやベースなど比較的足元操作に慣れた演奏者を主対象としたが，今後は鍵盤楽器や管楽器など，他の演奏スタイルにも適応可能な照明操作手法の開発をしていきたい．"
        }
    ],
    "references": [
        {
            "sign": "[1]",
            "content": "神野満里奈，福原義久：歌詞や曲調の印象に基づいた照明演出の自動生成システムの実現，エンタテインメントコンピューティングシンポジウム論文集，Vol. 2021, pp. 135–143（オンライン），入手先⟨https://cir.nii.ac.jp/crid/1050292572110849792⟩(2021)."
        },
        {
            "sign": "[2]",
            "content": "田嶋水美，伊藤謙一郎：音楽のインタラクティブな視覚表現～電子ピアノ演奏に対するリアルタイムな映像生成～，インタラクション2023 論文集，Vol. 2023, pp. 241–245."
        }
    ]
}